-- classes
+-------+------------------+------+-----+---------+----------------+
| Field | Type             | Null | Key | Default | Extra          |
+-------+------------------+------+-----+---------+----------------+
| id    | int(10) unsigned | NO   | PRI | NULL    | auto_increment |
| name  | varchar(30)      | NO   |     | NULL    |                |
+-------+------------------+------+-----+---------+----------------+
-- students
+-----------+-------------------------------------+------+-----+---------+----------------+
| Field     | Type                                | Null | Key | Default | Extra          |
+-----------+-------------------------------------+------+-----+---------+----------------+
| id        | int(10) unsigned                    | NO   | PRI | NULL    | auto_increment |
| name      | varchar(20)                         | YES  |     |         |                |
| age       | tinyint(3) unsigned                 | YES  |     | 0       |                |
| height    | decimal(5,2)                        | YES  |     | NULL    |                |
| gender    | enum('男','女','中性','保密')       | YES  |     | 保密    |                |
| cls_id    | int(10) unsigned                    | YES  |     | 0       |                |
| is_delete | bit(1)                              | YES  |     | b'0'    |                |
+-----------+-------------------------------------+------+-----+---------+----------------+

-- 查询全部的班级

-- 查询全部的学生的“姓名”“年龄”“身高”“性别”

-- 查询身高为null的学生信息

-- 查询全部男生信息

-- 查询男生大于18岁的

-- 查询身高大于160，年龄在18-30之间的女性，并且按照年龄升序排列、身高倒序排列

-- 查询名字是三个字的同学 

-- 查询班级一共多少学生

-- 查询班级一共多少女生

-- 查询班级一共几种性别（两种方式：去重、分组）

-- 查询最大年龄，最小身高，平均身高

-- 查询最大年龄，最小身高，平均身高（保留两位小数）

-- 每页显示5条  查询第2页学生信息

-- 查询学生姓名、年龄、身高、性别、班级